<?php
/**
 * 彩票玩法基础类
 * @author stenfan
 */
namespace common\models\lottery;
use yii;

class Base{
    
     //玩法分类
     public $cate = [
         '100'  => [
               '1001' => '和值',
               '1002' => '点数',
               '1003' => '三军'
          ],
         
         '103'  => [
               '1031' => '和值',
               '1032' => '点数',
               '1033' => '三军'
         ],
         
         '105'  => [
                '1051' => '和值',
                '1052' => '点数',
                '1053' => '三军'
         ],
         
         '107'  => [
                '1071' => '和值',
                '1072' => '点数'
         ],
     ];
}